def list_even(a: int, b: int) -> list:
    """
    :param a: начало интервала
    :param b: конец интервала
    :return: список четных чисел на данном инттервале
    >>> list_even(a=1, b=4)
    [2]
    >>> list_even(a=1, b=20)
    [2, 4, 6, 8, 10, 12, 14, 16, 18]
    >>> list_even(a=1, b=40)
    [2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38]
    >>> list_even(a=1, b=70)
    [2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68]
    >>> list_even(a=1, b=100)
    [2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98]

    """
    if isinstance(a, int) or isinstance(b, int):
        list_1 = range(a, b)
        return [val for val in list_1 if val % 2 == 0]
    else:
        raise TypeError('Долны быть введены 2 целых числа не равных 0')
