shows = {'Секретные материалы': 'фантастика', 'Ведьмак': 'фэнтази', 'Клан Сопрано': 'криминал', '24': 'драма', 'Черное зеркало': 'фантастика', 'Во все тяжкие': 'криминал', 'Игра престолов': 'фэнтази',
         'Карточный домик': 'драма', 'Рик и Морти': 'фантастика'}
ratings = {'Секретные материалы': 0.9, 'Ведьмак': 0.95, 'Клан Сопрано': 0.8, '24': 0.75, 'Черное зеркало': 0.98,
           'Во все тяжкие': 0.85, 'Игра престолов': 0.87, 'Карточный домик': 0.82, 'Рик и Морти': 1}
print(result={k: {'Genre': v, 'Rating': ratings[k]} for k, v in shows.items()})
print(result={'Секретные материалы': {'Genre': 'фантастика', 'Rating': 0.9}, 'Ведьмак': {'Genre': 'фэнтази', 'Rating': 0.95}, 'Клан Сопрано': {'Genre': 'криминал', 'Rating': 0.8}, '24': {'Genre': 'драма', 'Rating': 0.75}, 'Черное зеркало': {
      'Genre': 'фантастика', 'Rating': 0.98}, 'Во все тяжкие': {'Genre': 'криминал', 'Rating': 0.85}, 'Игра престолов': {'Genre': 'фэнтази', 'Rating': 0.87}, 'Карточный домик': {'Genre': 'драма', 'Rating': 0.82}, 'Рик и Морти': {'Genre': 'фантастика', 'Rating': 1}})
