def list_gen(n: int) -> [list, str]:
    """
    Обмен на списке.
    :param n: количество элементов списка.
    :return: список, половины которого поменяны местами(если количество элементов списка нечетное,
    то - выдается соответствующее сообщение)
    >>> list_gen(n=12)
    [-10, -9, -8, -7, -6, -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
    [-4, -3, -2, -1, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, -10, -9, -8, -7, -6, -5]
    >>> list_gen(n=11)
    [-10, -9, -8, -7, -6, -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]
    'местами не меняем'

    """
    if isinstance(n, int) and n > 0 and n != 0:
        int_list = [i for i in range(-10, n + 1)]
        print(int_list)

        if n % 2 != 0:
            return 'местами не меняем'
        else:

            return int_list[n // 2:] + int_list[0:n // 2]
    else:
        raise TypeError('введите целое положительное число, не равное 0')
